pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2153.h
/* GCCTL1 Control Bits */
#define ACCTEIFG                         (0x0008)        /* Access time error flag */
#define ACCTEIFG_L                       (0x0008)
#define ACCTEIFG_0                       (0x0000)        /* No interrupt pending. */
#define ACCTEIFG_1                       (0x0008)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV when it is the highest pending interrupt. */
#define ACCTEIFG_1_L                     (0x0008)
#define UBDIFG                           (0x0004)        /* FRAM uncorrectable bit error detection flag */
#define UBDIFG_L                         (0x0004)
#define UBDIFG_0                         (0x0000)        /* No interrupt pending. */
#define UBDIFG_1                         (0x0004)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV when it is the highest pending interrupt. */
#define UBDIFG_1_L                       (0x0004)
#define CBDIFG                           (0x0002)        /* FRAM correctable bit error detection flag */
#define CBDIFG_L                         (0x0002)
#define CBDIFG_0                         (0x0000)        /* No interrupt is pending */
#define CBDIFG_1                         (0x0002)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV if it is the highest pending interrupt. */
#define CBDIFG_1_L                       (0x0002)


/*****************************************************************************
 ICC Registers
*****************************************************************************/

#define __MSP430_HAS_ICC__                    /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_ICC__ 0x06C0
#define ICC_BASE               __MSP430_BASEADDRESS_ICC__

sfr_w(ICCSC);                                 /* */
sfr_b(ICCSC_L);
sfr_b(ICCSC_H);
sfr_w(ICCMVS);                                /* */
sfr_b(ICCMVS_L);
sfr_b(ICCMVS_H);
sfr_w(ICCILSR0);                              /* */
sfr_b(ICCILSR0_L);
sfr_b(ICCILSR0_H);
sfr_w(ICCILSR1);                              /* */
sfr_b(ICCILSR1_L);
sfr_b(ICCILSR1_H);
sfr_w(ICCILSR2);                              /* */
sfr_b(ICCILSR2_L);
sfr_b(ICCILSR2_H);
sfr_w(ICCILSR3);                              /* */
sfr_b(ICCILSR3_L);
sfr_b(ICCILSR3_H);

/* ICC Register Offsets */
#define OFS_ICCSC                        (0x0000)
#define OFS_ICCSC_L                      OFS_ICCSC
#define OFS_ICCSC_H                      OFS_ICCSC+1
#define OFS_ICCMVS                       (0x0002)
#define OFS_ICCMVS_L                     OFS_ICCMVS
#define OFS_ICCMVS_H                     OFS_ICCMVS+1
#define OFS_ICCILSR0                     (0x0004)
#define OFS_ICCILSR0_L                   OFS_ICCILSR0
#define OFS_ICCILSR0_H                   OFS_ICCILSR0+1
#define OFS_ICCILSR1                     (0x0006)
#define OFS_ICCILSR1_L                   OFS_ICCILSR1
#define OFS_ICCILSR1_H                   OFS_ICCILSR1+1
#define OFS_ICCILSR2                     (0x0008)
#define OFS_ICCILSR2_L                   OFS_ICCILSR2
#define OFS_ICCILSR2_H                   OFS_ICCILSR2+1
#define OFS_ICCILSR3                     (0x000A)
#define OFS_ICCILSR3_L                   OFS_ICCILSR3
#define OFS_ICCILSR3_H                   OFS_ICCILSR3+1

/* ICC Control Bits */

/* ICCSC Control Bits */
#define ICMC                             (0x0003)        /* */
#define ICMC_L                           (0x0003)
#define ICMC0                            (0x0001)        /* */
#define ICMC0_L                          (0x0001)
#define ICMC1                            (0x0002)        /* */
#define ICMC1_L                          (0x0002)
#define VSFFLG                           (0x0010)        /* */
#define VSFFLG_L                         (0x0010)
#define VSFFLG_0                         (0x0000)        /* ICCMVS register is not full */
#define VSFFLG_1                         (0x0010)        /* ICCMVS register is full */
#define VSFFLG_1_L                       (0x0010)
#define VSEFLG                           (0x0020)        /* */
#define VSEFLG_L                         (0x0020)
#define VSEFLG_0                         (0x0000)        /* Stack has valid data */
#define VSEFLG_1                         (0x0020)        /* Stack has no valid data */
#define VSEFLG_1_L                       (0x0020)
#define ICCEN                            (0x0080)        /* */
#define ICCEN_L                          (0x0080)
#define ICCEN_0                          (0x0000)        /* ICC module disabled */
#define ICCEN_1                          (0x0080)        /* ICC module enabled */
#define ICCEN_1_L                        (0x0080)

/* ICCMVS Control Bits */
#define ICM0                             (0x0003)        /* */
#define ICM0_L                           (0x0003)
#define ICM00                            (0x0001)        /* */
#define ICM00_L                          (0x0001)
#define ICM01                            (0x0002)        /* */
#define ICM01_L                          (0x0002)
#define ICM1                             (0x000c)        /* */
#define ICM1_L                           (0x000c)
#define ICM10                            (0x0004)        /* */
#define ICM10_L                          (0x0004)
#define ICM11                            (0x0008)        /* */
#define ICM11_L                          (0x0008)
#define ICM3                             (0x00c0)        /* */
#define ICM3_L                           (0x00c0)
#define ICM30                            (0x0040)        /* */
#define ICM30_L                          (0x0040)
#define ICM31                            (0x0080)        /* */
#define ICM31_L                          (0x0080)
#define MVSSP                            (0x0700)        /* */
#define MVSSP_H                          (0x0007)
#define MVSSP0                           (0x0100)        /* */
#define MVSSP0_H                         (0x0001)
#define MVSSP1                           (0x0200)        /* */
#define MVSSP1_H                         (0x0002)
#define MVSSP2                           (0x0400)        /* */
#define MVSSP2_H                         (0x0004)
#define MVSSP_0                          (0x0000)        /* 000b = Stack empty */
#define MVSSP_1                          (0x0100)        /* 001b = ICM0 affected */
#define MVSSP_1_H                        (0x0001)
#define MVSSP_2                          (0x0200)        /* 010b = ICM0 and ICM1 affected */
#define MVSSP_2_H                        (0x0002)
#define MVSSP_3                          (0x0300)        /* 011b = ICM0, ICM1, and ICM2 affected */
#define MVSSP_3_H                        (0x0003)
#define MVSSP_4                          (0x0400)        /* 100b = ICM0, ICM1, ICM2, and ICM3 affected. Also means the 
                                                            stack is full. */
#define MVSSP_4_H                        (0x0004)
#define ICM2                             (0x0030)        /* */
#define ICM2_L                           (0x0030)
#define ICM20                            (0x0010)        /* */
#define ICM20_L                          (0x0010)
#define ICM21                            (0x0020)        /* */
#define ICM21_L                          (0x0020)

/* ICCILSR0 Control Bits */
#define ILSR0                            (0x0003)        /* */
#define ILSR0_L                          (0x0003)
#define ILSR00                           (0x0001)        /* */
#define ILSR00_L                         (0x0001)
#define ILSR01                           (0x0002)        /* */
#define ILSR01_L                         (0x0002)
#define ILSR__PORT4                      (0x0003)
#define ILSR__PORT4_LEVEL0               (0x0000)
#define ILSR__PORT4_LEVEL1               (0x0001)
#define ILSR__PORT4_LEVEL2               (0x0002)
#define ILSR__PORT4_LEVEL3               (0x0003)
#define ILSR1                            (0x000c)        /* */
#define ILSR1_L                          (0x000c)
#define ILSR10                           (0x0004)        /* */
#define ILSR10_L                         (0x0004)
#define ILSR11                           (0x0008)        /* */
#define ILSR11_L                         (0x0008)
#define ILSR__PORT3                      (0x000c)
#define ILSR__PORT3_LEVEL0               (0x0000)
#define ILSR__PORT3_LEVEL1               (0x0004)
#define ILSR__PORT3_LEVEL2               (0x0008)
#define ILSR__PORT3_LEVEL3               (0x000c)
#define ILSR2                            (0x0030)        /* */
#define ILSR2_L                          (0x0030)
#define ILSR20                           (0x0010)        /* */
#define ILSR20_L                         (0x0010)
#define ILSR21                           (0x0020)        /* */
#define ILSR21_L                         (0x0020)
#define ILSR__PORT2                      (0x0030)
#define ILSR__PORT2_LEVEL0               (0x0000)
#define ILSR__PORT2_LEVEL1               (0x0010)
#define ILSR__PORT2_LEVEL2               (0x0020)
#define ILSR__PORT2_LEVEL3               (0x0030)
#define ILSR3                            (0x00c0)        /* */
#define ILSR3_L                          (0x00c0)
#define ILSR30                           (0x0040)        /* */
#define ILSR30_L                         (0x0040)
#define ILSR31                           (0x0080)        /* */
#define ILSR31_L                         (0x0080)
#define ILSR__PORT1                      (0x00c0)
#define ILSR__PORT1_LEVEL0               (0x0000)
#define ILSR__PORT1_LEVEL1               (0x0040)
#define ILSR__PORT1_LEVEL2               (0x0080)
#define ILSR__PORT1_LEVEL3               (0x00c0)
#define ILSR4                            (0x0300)        /* */
#define ILSR4_H                          (0x0003)
#define ILSR40                           (0x0100)        /* */
#define ILSR40_H                         (0x0001)
#define ILSR41                           (0x0200)        /* */
#define ILSR41_H                         (0x0002)
#define ILSR__SAC1_SAC3                  (0x0300)
#define ILSR__SAC1_SAC3_LEVEL0           (0x0000)
#define ILSR__SAC1_SAC3_LEVEL1           (0x0100)
#define ILSR__SAC1_SAC3_LEVEL2           (0x0200)
#define ILSR__SAC1_SAC3_LEVEL3           (0x0300)
#define ILSR5                            (0x0c00)        /* */
#define ILSR5_H                          (0x000c)
#define ILSR50                           (0x0400)        /* */
#define ILSR50_H                         (0x0004)
#define ILSR51                           (0x0800)        /* */
#define ILSR51_H                         (0x0008)
#define ILSR__SAC0_SAC2                  (0x0c00)
#define ILSR__SAC0_SAC2_LEVEL0           (0x0000)
#define ILSR__SAC0_SAC2_LEVEL1           (0x0400)
#define ILSR__SAC0_SAC2_LEVEL2           (0x0800)
#define ILSR__SAC0_SAC2_LEVEL3           (0x0c00)
#define ILSR6                            (0x3000)        /* */
#define ILSR6_H                          (0x0030)
#define ILSR60                           (0x1000)        /* */
#define ILSR60_H                         (0x0010)
#define ILSR61                           (0x2000)        /* */
#define ILSR61_H                         (0x0020)
#define ILSR__eCOMP0_eCOMP1              (0x3000)
#define ILSR__eCOMP0_eCOMP1_LEVEL0       (0x0000)
#define ILSR__eCOMP0_eCOMP1_LEVEL1       (0x1000)
#define ILSR__eCOMP0_eCOMP1_LEVEL2       (0x2000)
#define ILSR__eCOMP0_eCOMP1_LEVEL3       (0x3000)
#define ILSR7                            (0xc000)        /* */
#define ILSR7_H                          (0x00c0)
#define ILSR70                           (0x4000)        /* */
#define ILSR70_H                         (0x0040)
#define ILSR71                           (0x8000)        /* */
#define ILSR71_H                         (0x0080)
#define ILSR__ADC                        (0xc000)
#define ILSR__ADC_LEVEL0                 (0x0000)
#define ILSR__ADC_LEVEL1                 (0x4000)
#define ILSR__ADC_LEVEL2                 (0x8000)
#define ILSR__ADC_LEVEL3                 (0xc000)

/* ICCILSR1 Control Bits */
#define ILSR8                            (0x0003)        /* */
#define ILSR8_L                          (0x0003)
#define ILSR80                           (0x0001)        /* */
#define ILSR80_L                         (0x0001)
#define ILSR81                           (0x0002)        /* */
#define ILSR81_L                         (0x0002)
#define ILSR__eUSCI_B1                   (0x0003)
#define ILSR__eUSCI_B1_LEVEL0            (0x0000)
#define ILSR__eUSCI_B1_LEVEL1            (0x0001)
#define ILSR__eUSCI_B1_LEVEL2            (0x0002)
#define ILSR__eUSCI_B1_LEVEL3            (0x0003)
#define ILSR9                            (0x000c)        /* */
#define ILSR9_L                          (0x000c)
#define ILSR90                           (0x0004)        /* */
#define ILSR90_L                         (0x0004)
#define ILSR91                           (0x0008)        /* */
#define ILSR91_L                         (0x0008)
#define ILSR__eUSCI_B0                   (0x000c)
#define ILSR__eUSCI_B0_LEVEL0            (0x0000)
#define ILSR__eUSCI_B0_LEVEL1            (0x0004)
#define ILSR__eUSCI_B0_LEVEL2            (0x0008)
#define ILSR__eUSCI_B0_LEVEL3            (0x000c)
#define ILSR100                          (0x0010)        /* */
#define ILSR100_L                        (0x0010)
#define ILSR101                          (0x0020)        /* */
#define ILSR101_L                        (0x0020)
#define ILSR__eUSCI_A1                   (0x0030)
#define ILSR__eUSCI_A1_LEVEL0            (0x0000)
#define ILSR__eUSCI_A1_LEVEL1            (0x0010)
#define ILSR__eUSCI_A1_LEVEL2            (0x0020)
#define ILSR__eUSCI_A1_LEVEL3            (0x0030)
#define ILSR110                          (0x0040)        /* */
#define ILSR110_L                        (0x0040)
#define ILSR111                          (0x0080)        /* */
#define ILSR111_L                        (0x0080)
#define ILSR__eUSCI_A0                   (0x00c0)
#define ILSR__eUSCI_A0_LEVEL0            (0x0000)
#define ILSR__eUSCI_A0_LEVEL1            (0x0040)
#define ILSR__eUSCI_A0_LEVEL2            (0x0080)
#define ILSR__eUSCI_A0_LEVEL3            (0x00c0)
#define ILSR12                           (0x0300)        /* */
#define ILSR12_H                         (0x0003)
#define ILSR120                          (0x0100)        /* */
#define ILSR120_H                        (0x0001)
#define ILSR121                          (0x0200)        /* */
#define ILSR121_H                        (0x0002)
#define ILSR__WDT                        (0x0300)
#define ILSR__WDT_LEVEL0                 (0x0000)
#define ILSR__WDT_LEVEL1                 (0x0100)
#define ILSR__WDT_LEVEL2                 (0x0200)
#define ILSR__WDT_LEVEL3                 (0x0300)
#define ILSR13                           (0x0c00)        /* */
#define ILSR13_H                         (0x000c)
#define ILSR130                          (0x0400)        /* */
#define ILSR130_H                        (0x0004)
#define ILSR131                          (0x0800)        /* */
#define ILSR131_H                        (0x0008)
#define ILSR__RTC                        (0x0c00)
#define ILSR__RTC_LEVEL0                 (0x0000)
#define ILSR__RTC_LEVEL1                 (0x0400)
#define ILSR__RTC_LEVEL2                 (0x0800)
#define ILSR__RTC_LEVEL3                 (0x0c00)
#define ILSR14                           (0x3000)        /* */
#define ILSR14_H                         (0x0030)
#define ILSR140                          (0x1000)        /* */
#define ILSR140_H                        (0x0010)
#define ILSR141                          (0x2000)        /* */
#define ILSR141_H                        (0x0020)
#define ILSR__TIMER3_B1                  (0x3000)
#define ILSR__TIMER3_B1_LEVEL0           (0x0000)
#define ILSR__TIMER3_B1_LEVEL1           (0x1000)
#define ILSR__TIMER3_B1_LEVEL2           (0x2000)
#define ILSR__TIMER3_B1_LEVEL3           (0x3000)
#define ILSR15                           (0xc000)        /* */
#define ILSR15_H                         (0x00c0)
#define ILSR150                          (0x4000)        /* */
#define ILSR150_H                        (0x0040)
#define ILSR151                          (0x8000)        /* */
#define ILSR151_H                        (0x0080)
#define ILSR__TIMER3_B0                  (0xc000)
#define ILSR__TIMER3_B0_LEVEL0           (0x0000)
#define ILSR__TIMER3_B0_LEVEL1           (0x4000)
#define ILSR__TIMER3_B0_LEVEL2           (0x8000)
#define ILSR__TIMER3_B0_LEVEL3           (0xc000)

/* ICCILSR2 Control Bits */
#define ILSR16                           (0x0003)        /* */
#define ILSR16_L                         (0x0003)
#define ILSR160                          (0x0001)        /* */
#define ILSR160_L                        (0x0001)
#define ILSR161                          (0x0002)        /* */
#define ILSR161_L                        (0x0002)
#define ILSR__TIMER2_B1                  (0x0003)
#define ILSR__TIMER2_B1_LEVEL0           (0x0000)
#define ILSR__TIMER2_B1_LEVEL1           (0x0001)
#define ILSR__TIMER2_B1_LEVEL2           (0x0002)
#define ILSR__TIMER2_B1_LEVEL3           (0x0003)
#define ILSR17                           (0x000c)        /* */
#define ILSR17_L                         (0x000c)
#define ILSR170                          (0x0004)        /* */
#define ILSR170_L                        (0x0004)
#define ILSR171                          (0x0008)        /* */
#define ILSR171_L                        (0x0008)
#define ILSR__TIMER2_B0                  (0x000c)
#define ILSR__TIMER2_B0_LEVEL0           (0x0000)
#define ILSR__TIMER2_B0_LEVEL1           (0x0004)
#define ILSR__TIMER2_B0_LEVEL2           (0x0008)
#define ILSR__TIMER2_B0_LEVEL3           (0x000c)
#define ILSR18                           (0x0030)        /* */
#define ILSR18_L                         (0x0030)
#define ILSR180                          (0x0010)        /* */
#define ILSR180_L                        (0x0010)
#define ILSR181                          (0x0020)        /* */
#define ILSR181_L                        (0x0020)
#define ILSR__TIMER1_B1                  (0x0030)
#define ILSR__TIMER1_B1_LEVEL0           (0x0000)
#define ILSR__TIMER1_B1_LEVEL1           (0x0010)
#define ILSR__TIMER1_B1_LEVEL2           (0x0020)
#define ILSR__TIMER1_B1_LEVEL3           (0x0030)
#define ILSR19                           (0x00c0)        /* */
#define ILSR19_L                         (0x00c0)
#define ILSR190                          (0x0040)        /* */
#define ILSR190_L                        (0x0040)
#define ILSR191                          (0x0080)        /* */
#define ILSR191_L                        (0x0080)
#define ILSR__TIMER1_B0                  (0x00c0)
#define ILSR__TIMER1_B0_LEVEL0           (0x0000)
#define ILSR__TIMER1_B0_LEVEL1           (0x0040)
#define ILSR__TIMER1_B0_LEVEL2           (0x0080)
#define ILSR__TIMER1_B0_LEVEL3           (0x00c0)
#define ILSR200                          (0x0100)        /* */
#define ILSR200_H                        (0x0001)
#define ILSR201                          (0x0200)        /* */
#define ILSR201_H                        (0x0002)
#define ILSR__TIMER0_B1                  (0x0300)
#define ILSR__TIMER0_B1_LEVEL0           (0x0000)
#define ILSR__TIMER0_B1_LEVEL1           (0x0100)
#define ILSR__TIMER0_B1_LEVEL2           (0x0200)
#define ILSR__TIMER0_B1_LEVEL3           (0x0300)
#define ILSR210                          (0x0400)        /* */
#define ILSR210_H                        (0x0004)
#define ILSR211                          (0x0800)        /* */
#define ILSR211_H                        (0x0008)
#define ILSR__TIMER0_B0                  (0x0c00)
#define ILSR__TIMER0_B0_LEVEL0           (0x0000)
#define ILSR__TIMER0_B0_LEVEL1           (0x0400)
#define ILSR__TIMER0_B0_LEVEL2           (0x0800)
#define ILSR__TIMER0_B0_LEVEL3           (0x0c00)
#define ILSR22                           (0x3000)        /* */
#define ILSR22_H                         (0x0030)
#define ILSR220                          (0x1000)        /* */
#define ILSR220_H                        (0x0010)
#define ILSR221                          (0x2000)        /* */
#define ILSR221_H                        (0x0020)
#define ILSR23                           (0xc000)        /* */
#define ILSR23_H                         (0x00c0)
#define ILSR230                          (0x4000)        /* */
#define ILSR230_H                        (0x0040)
#define ILSR231                          (0x8000)        /* */
#define ILSR231_H                        (0x0080)

/* ICCILSR3 Control Bits */
#define ILSR24                           (0x0003)        /* */
#define ILSR24_L                         (0x0003)
#define ILSR240                          (0x0001)        /* */
#define ILSR240_L                        (0x0001)
#define ILSR241                          (0x0002)        /* */
#define ILSR241_L                        (0x0002)
#define ILSR25                           (0x000c)        /* */
#define ILSR25_L                         (0x000c)
#define ILSR250                          (0x0004)        /* */
#define ILSR250_L                        (0x0004)
#define ILSR251                          (0x0008)        /* */
#define ILSR251_L                        (0x0008)
#define ILSR26                           (0x0030)        /* */
#define ILSR26_L                         (0x0030)
#define ILSR260                          (0x0010)        /* */
#define ILSR260_L                        (0x0010)
#define ILSR261                          (0x0020)        /* */
#define ILSR261_L                        (0x0020)
#define ILSR27                           (0x00c0)        /* */
#define ILSR27_L                         (0x00c0)
#define ILSR270                          (0x0040)        /* */
#define ILSR270_L                        (0x0040)
#define ILSR271                          (0x0080)        /* */
#define ILSR271_L                        (0x0080)
#define ILSR28                           (0x0300)        /* */
#define ILSR28_H                         (0x0003)
#define ILSR280                          (0x0100)        /* */
#define ILSR280_H                        (0x0001)
#define ILSR281                          (0x0200)        /* */
#define ILSR281_H                        (0x0002)
#define ILSR29                           (0x0c00)        /* */
#define ILSR29_H                         (0x000c)
#define ILSR290                          (0x0400)        /* */
#define ILSR290_H                        (0x0004)
#define ILSR291                          (0x0800)        /* */
#define ILSR291_H                        (0x0008)
#define ILSR300                          (0x1000)        /* */
#define ILSR300_H                        (0x0010)
#define ILSR301                          (0x2000)        /* */
#define ILSR301_H                        (0x0020)
#define ILSR310                          (0x4000)        /* */
#define ILSR310_H                        (0x0040)
#define ILSR311                          (0x8000)        /* */
#define ILSR311_H                        (0x0080)


/*****************************************************************************
 MPY32 Registers
*****************************************************************************/

#define __MSP430_HAS_MPY32__                  /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_MPY32__ 0x04C0
#define MPY32_BASE             __MSP430_BASEADDRESS_MPY32__

